Revit 2027 API
PlanTopologySet.Insert Method
Insert the specified item into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	PlanTopology item
)
Public Overridable Function Insert (
	item As PlanTopology
) As Boolean
public:
virtual bool Insert(
	PlanTopology^ item
)
abstract Insert :
        item : PlanTopology -> bool
override Insert :
        item : PlanTopology -> bool
Parameters
item PlanTopology
The item to be inserted into the set.
Return Value
Boolean
Returns whether the item was inserted into the set.
See Also
Reference
PlanTopologySet Class
Autodesk.Revit.DB Namespace